In [5]:
import pandas as pd
import numpy as np

In [11]:
dataFrameExcel = pd.read_excel("Book.xlsx")

In [12]:
dataFrameExcel

     Name  Point   Age     Department
0   Yusuf    450  20.0       Software
1   Hamza    120  22.0        Finance
2  Mehmet    300  24.0        Finance
3   Abdul    200   NaN  Communication
4   Atlas    250  28.0            NaN
5     Ali    125  20.0       Commerce
6   Zehra    100  19.0       Software
7  Zeynep    500  18.0        Finance
8    Esma    275  25.0        Manager

In [10]:
dataFrameExcel.dropna()

     Name  Point   Age Department
0   Yusuf    450  20.0   Software
1   Hamza    120  22.0    Finance
2  Mehmet    300  24.0    Finance
5     Ali    125  20.0   Commerce
6   Zehra    100  19.0   Software
7  Zeynep    500  18.0    Finance
8    Esma    275  25.0    Manager

In [13]:
filledDataFrameExcel = dataFrameExcel.dropna()

In [14]:
filledDataFrameExcel.to_excel("newBook.xlsx")

In [1]:
## If the format is called = > .csv
## read_csv("name.csv")
## to_csv("name.csv")